test/cassettes/shipments/refund.yml


-
    request:
        method: POST
        url: 'https://api.easypost.com/v2/shipments'
        headers:
            Host: api.easypost.com
            Accept: application/json
            Authorization: ''
            Content-Type: application/json
            User-Agent: ''
        body: '{"shipment":{"to_address":{"name":"Jack Sparrow","street1":"388 Townsend St","street2":"Apt 20","city":"San Francisco","state":"CA","zip":"94107","country":"US","email":"test@example.com","phone":"5555555555"},"from_address":{"name":"Elizabeth Swan","street1":"179 N Harbor Dr","city":"Redondo Beach","state":"CA","zip":"90277","country":"US","email":"test@example.com","phone":"5555555555"},"parcel":{"length":"10","width":"8","height":"4","weight":"15.4"},"service":"First","carrier_accounts":["ca_8dc116debcdb49b5a66a2ddee4612600"],"carrier":"USPS"},"carbon_offset":"false"}'
    response:
        status:
            http_version: '2'
            code: '201'
            message: ''
        headers:
            x-frame-options: SAMEORIGIN
            x-xss-protection: '1; mode=block'
            x-content-type-options: nosniff
            x-download-options: noopen
            x-permitted-cross-domain-policies: none
            referrer-policy: strict-origin-when-cross-origin
            x-ep-request-uuid: b5225cc662fbd719e787520600075bc3
            cache-control: 'private, no-cache, no-store'
            pragma: no-cache
            expires: '0'
            location: /api/v2/shipments/shp_b948e155624f4fc89627e78844e454c7
            content-type: 'application/json; charset=utf-8'
            content-length: '7077'
            etag: 'W/"2ffbdd5d31a8df6f6311eb6ac15b75fe"'
            x-runtime: '1.044745'
            x-node: bigweb5nuq
            x-version-label: easypost-202208152354-15cac62d1c-master
            x-backend: easypost
            x-proxied: ['intlb1nuq 6aa9972c1e', 'extlb2nuq 9ce216bfac']
            strict-transport-security: 'max-age=31536000; includeSubDomains; preload'
        body: '{"created_at":"2022-08-16T17:42:49Z","is_return":false,"messages":[],"mode":"test","options":{"currency":"USD","payment":{"type":"SENDER"},"date_advance":0},"reference":null,"status":"unknown","tracking_code":"9400100109361133346592","updated_at":"2022-08-16T17:42:50Z","batch_id":null,"batch_status":null,"batch_message":null,"customs_info":null,"from_address":{"id":"adr_d8b1082d1d8a11edb1a4ac1f6bc72124","object":"Address","created_at":"2022-08-16T17:42:49+00:00","updated_at":"2022-08-16T17:42:49+00:00","name":"Elizabeth Swan","company":null,"street1":"179 N Harbor Dr","street2":null,"city":"Redondo Beach","state":"CA","zip":"90277","country":"US","phone":"5555555555","email":"test@example.com","mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":[]},"insurance":"50.00","order_id":null,"parcel":{"id":"prcl_c837c9d9c4a247d1b2f2cafd504792da","object":"Parcel","created_at":"2022-08-16T17:42:49Z","updated_at":"2022-08-16T17:42:49Z","length":10,"width":8,"height":4,"predefined_package":null,"weight":15.4,"mode":"test"},"postage_label":{"object":"PostageLabel","id":"pl_fc58d4c87eea481587f8d04898560e60","created_at":"2022-08-16T17:42:50Z","updated_at":"2022-08-16T17:42:50Z","date_advance":0,"integrated_form":"none","label_date":"2022-08-16T17:42:50Z","label_resolution":300,"label_size":"4x6","label_type":"default","label_file_type":"image\/png","label_url":"https:\/\/easypost-files.s3.us-west-2.amazonaws.com\/files\/postage_label\/20220816\/7a085ed45c5342b3a8b35ba24ac45c12.png","label_pdf_url":null,"label_zpl_url":null,"label_epl2_url":null,"label_file":null},"rates":[{"id":"rate_8c96b4f3df6245b983af077c115df939","object":"Rate","created_at":"2022-08-16T17:42:49Z","updated_at":"2022-08-16T17:42:49Z","mode":"test","service":"Express","carrier":"USPS","rate":"29.50","currency":"USD","retail_rate":"33.55","retail_currency":"USD","list_rate":"29.50","list_currency":"USD","billing_type":"easypost","delivery_days":null,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":null,"shipment_id":"shp_b948e155624f4fc89627e78844e454c7","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_d873263827c74aafa9050b051a4fc47c","object":"Rate","created_at":"2022-08-16T17:42:49Z","updated_at":"2022-08-16T17:42:49Z","mode":"test","service":"Priority","carrier":"USPS","rate":"7.90","currency":"USD","retail_rate":"9.45","retail_currency":"USD","list_rate":"7.90","list_currency":"USD","billing_type":"easypost","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_b948e155624f4fc89627e78844e454c7","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_e5b291c7e0644ac39db8bdd89b8968e0","object":"Rate","created_at":"2022-08-16T17:42:49Z","updated_at":"2022-08-16T17:42:49Z","mode":"test","service":"ParcelSelect","carrier":"USPS","rate":"7.75","currency":"USD","retail_rate":"7.75","retail_currency":"USD","list_rate":"7.75","list_currency":"USD","billing_type":"easypost","delivery_days":5,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":5,"shipment_id":"shp_b948e155624f4fc89627e78844e454c7","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_2bd1aa99d2fb4d68b75be513913d9f38","object":"Rate","created_at":"2022-08-16T17:42:49Z","updated_at":"2022-08-16T17:42:49Z","mode":"test","service":"First","carrier":"USPS","rate":"5.57","currency":"USD","retail_rate":"5.57","retail_currency":"USD","list_rate":"5.57","list_currency":"USD","billing_type":"easypost","delivery_days":3,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":3,"shipment_id":"shp_b948e155624f4fc89627e78844e454c7","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"}],"refund_status":null,"scan_form":null,"selected_rate":{"id":"rate_2bd1aa99d2fb4d68b75be513913d9f38","object":"Rate","created_at":"2022-08-16T17:42:50Z","updated_at":"2022-08-16T17:42:50Z","mode":"test","service":"First","carrier":"USPS","rate":"5.57","currency":"USD","retail_rate":"5.57","retail_currency":"USD","list_rate":"5.57","list_currency":"USD","billing_type":"easypost","delivery_days":3,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":3,"shipment_id":"shp_b948e155624f4fc89627e78844e454c7","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},"tracker":{"id":"trk_11a499d5662240309009fb99fa07dfab","object":"Tracker","mode":"test","tracking_code":"9400100109361133346592","status":"unknown","status_detail":"unknown","created_at":"2022-08-16T17:42:50Z","updated_at":"2022-08-16T17:42:50Z","signed_by":null,"weight":null,"est_delivery_date":null,"shipment_id":"shp_b948e155624f4fc89627e78844e454c7","carrier":"USPS","tracking_details":[],"fees":[],"carrier_detail":null,"public_url":"https:\/\/track.easypost.com\/djE6dHJrXzExYTQ5OWQ1NjYyMjQwMzA5MDA5ZmI5OWZhMDdkZmFi"},"to_address":{"id":"adr_d8af32e01d8a11edb1a1ac1f6bc72124","object":"Address","created_at":"2022-08-16T17:42:49+00:00","updated_at":"2022-08-16T17:42:49+00:00","name":"JACK SPARROW","company":null,"street1":"388 TOWNSEND ST APT 20","street2":null,"city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"5555555555","email":"TEST@EXAMPLE.COM","mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America\/Los_Angeles"}}}},"usps_zone":4,"return_address":{"id":"adr_d8b1082d1d8a11edb1a4ac1f6bc72124","object":"Address","created_at":"2022-08-16T17:42:49+00:00","updated_at":"2022-08-16T17:42:49+00:00","name":"Elizabeth Swan","company":null,"street1":"179 N Harbor Dr","street2":null,"city":"Redondo Beach","state":"CA","zip":"90277","country":"US","phone":"5555555555","email":"test@example.com","mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":[]},"buyer_address":{"id":"adr_d8af32e01d8a11edb1a1ac1f6bc72124","object":"Address","created_at":"2022-08-16T17:42:49+00:00","updated_at":"2022-08-16T17:42:49+00:00","name":"JACK SPARROW","company":null,"street1":"388 TOWNSEND ST APT 20","street2":null,"city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"5555555555","email":"TEST@EXAMPLE.COM","mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America\/Los_Angeles"}}}},"forms":[],"fees":[{"object":"Fee","type":"LabelFee","amount":"0.00000","charged":true,"refunded":false},{"object":"Fee","type":"PostageFee","amount":"5.57000","charged":true,"refunded":false},{"object":"Fee","type":"InsuranceFee","amount":"0.25000","charged":true,"refunded":false}],"id":"shp_b948e155624f4fc89627e78844e454c7","object":"Shipment"}'
        curl_info:
            url: 'https://api.easypost.com/v2/shipments'
            content_type: 'application/json; charset=utf-8'
            http_code: 201
            header_size: 794
            request_size: 306
            filetime: -1
            ssl_verify_result: 0
            redirect_count: 0
            total_time: 1.2769
            namelookup_time: 0.001746
            connect_time: 0.074902
            pretransfer_time: 0.15748
            size_upload: 577.0
            size_download: 7077.0
            speed_download: 5542.0
            speed_upload: 451.0
            download_content_length: 7077.0
            upload_content_length: 577.0
            starttransfer_time: 0.157485
            redirect_time: 0.0
            redirect_url: ''
            primary_ip: 169.62.110.130
            certinfo: {  }
            primary_port: 443
            local_ip: 10.130.6.17
            local_port: 51883
            http_version: 3
            protocol: 2
            ssl_verifyresult: 0
            scheme: HTTPS
            appconnect_time_us: 157377
            connect_time_us: 74902
            namelookup_time_us: 1746
            pretransfer_time_us: 157480
            redirect_time_us: 0
            starttransfer_time_us: 157485
            total_time_us: 1276900
-
    request:
        method: GET
        url: 'https://api.easypost.com/v2/shipments/shp_b948e155624f4fc89627e78844e454c7/refund'
        headers:
            Host: api.easypost.com
            Accept: application/json
            Authorization: ''
            Content-Type: application/json
            User-Agent: ''
    response:
        status:
            http_version: '2'
            code: '200'
            message: ''
        headers:
            x-frame-options: SAMEORIGIN
            x-xss-protection: '1; mode=block'
            x-content-type-options: nosniff
            x-download-options: noopen
            x-permitted-cross-domain-policies: none
            referrer-policy: strict-origin-when-cross-origin
            x-ep-request-uuid: b5225cc562fbd71ae787520700075c5d
            cache-control: 'private, no-cache, no-store'
            pragma: no-cache
            expires: '0'
            content-type: 'application/json; charset=utf-8'
            content-length: '8218'
            etag: 'W/"4d6e44285fc18b56558a323850acfd65"'
            x-runtime: '0.161306'
            x-node: bigweb2nuq
            x-version-label: easypost-202208152354-15cac62d1c-master
            x-backend: easypost
            x-proxied: ['intlb2nuq 6aa9972c1e', 'extlb2nuq 9ce216bfac']
            strict-transport-security: 'max-age=31536000; includeSubDomains; preload'
        body: '{"created_at":"2022-08-16T17:42:49Z","is_return":false,"messages":[],"mode":"test","options":{"currency":"USD","payment":{"type":"SENDER"},"date_advance":0},"reference":null,"status":"unknown","tracking_code":"9400100109361133346592","updated_at":"2022-08-16T17:42:51Z","batch_id":null,"batch_status":null,"batch_message":null,"customs_info":null,"from_address":{"id":"adr_d8b1082d1d8a11edb1a4ac1f6bc72124","object":"Address","created_at":"2022-08-16T17:42:49+00:00","updated_at":"2022-08-16T17:42:49+00:00","name":"Elizabeth Swan","company":null,"street1":"179 N Harbor Dr","street2":null,"city":"Redondo Beach","state":"CA","zip":"90277","country":"US","phone":"5555555555","email":"test@example.com","mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":[]},"insurance":"50.00","order_id":null,"parcel":{"id":"prcl_c837c9d9c4a247d1b2f2cafd504792da","object":"Parcel","created_at":"2022-08-16T17:42:49Z","updated_at":"2022-08-16T17:42:49Z","length":10,"width":8,"height":4,"predefined_package":null,"weight":15.4,"mode":"test"},"postage_label":{"object":"PostageLabel","id":"pl_fc58d4c87eea481587f8d04898560e60","created_at":"2022-08-16T17:42:50Z","updated_at":"2022-08-16T17:42:50Z","date_advance":0,"integrated_form":"none","label_date":"2022-08-16T17:42:50Z","label_resolution":300,"label_size":"4x6","label_type":"default","label_file_type":"image\/png","label_url":"https:\/\/easypost-files.s3.us-west-2.amazonaws.com\/files\/postage_label\/20220816\/7a085ed45c5342b3a8b35ba24ac45c12.png","label_pdf_url":null,"label_zpl_url":null,"label_epl2_url":null,"label_file":null},"rates":[{"id":"rate_8c96b4f3df6245b983af077c115df939","object":"Rate","created_at":"2022-08-16T17:42:49Z","updated_at":"2022-08-16T17:42:49Z","mode":"test","service":"Express","carrier":"USPS","rate":"29.50","currency":"USD","retail_rate":"33.55","retail_currency":"USD","list_rate":"29.50","list_currency":"USD","billing_type":"easypost","delivery_days":null,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":null,"shipment_id":"shp_b948e155624f4fc89627e78844e454c7","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_d873263827c74aafa9050b051a4fc47c","object":"Rate","created_at":"2022-08-16T17:42:49Z","updated_at":"2022-08-16T17:42:49Z","mode":"test","service":"Priority","carrier":"USPS","rate":"7.90","currency":"USD","retail_rate":"9.45","retail_currency":"USD","list_rate":"7.90","list_currency":"USD","billing_type":"easypost","delivery_days":2,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":2,"shipment_id":"shp_b948e155624f4fc89627e78844e454c7","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_e5b291c7e0644ac39db8bdd89b8968e0","object":"Rate","created_at":"2022-08-16T17:42:49Z","updated_at":"2022-08-16T17:42:49Z","mode":"test","service":"ParcelSelect","carrier":"USPS","rate":"7.75","currency":"USD","retail_rate":"7.75","retail_currency":"USD","list_rate":"7.75","list_currency":"USD","billing_type":"easypost","delivery_days":5,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":5,"shipment_id":"shp_b948e155624f4fc89627e78844e454c7","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},{"id":"rate_2bd1aa99d2fb4d68b75be513913d9f38","object":"Rate","created_at":"2022-08-16T17:42:49Z","updated_at":"2022-08-16T17:42:49Z","mode":"test","service":"First","carrier":"USPS","rate":"5.57","currency":"USD","retail_rate":"5.57","retail_currency":"USD","list_rate":"5.57","list_currency":"USD","billing_type":"easypost","delivery_days":3,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":3,"shipment_id":"shp_b948e155624f4fc89627e78844e454c7","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"}],"refund_status":"submitted","scan_form":null,"selected_rate":{"id":"rate_2bd1aa99d2fb4d68b75be513913d9f38","object":"Rate","created_at":"2022-08-16T17:42:50Z","updated_at":"2022-08-16T17:42:50Z","mode":"test","service":"First","carrier":"USPS","rate":"5.57","currency":"USD","retail_rate":"5.57","retail_currency":"USD","list_rate":"5.57","list_currency":"USD","billing_type":"easypost","delivery_days":3,"delivery_date":null,"delivery_date_guaranteed":false,"est_delivery_days":3,"shipment_id":"shp_b948e155624f4fc89627e78844e454c7","carrier_account_id":"ca_8dc116debcdb49b5a66a2ddee4612600"},"tracker":{"id":"trk_11a499d5662240309009fb99fa07dfab","object":"Tracker","mode":"test","tracking_code":"9400100109361133346592","status":"pre_transit","status_detail":"status_update","created_at":"2022-08-16T17:42:50Z","updated_at":"2022-08-16T17:42:50Z","signed_by":null,"weight":null,"est_delivery_date":"2022-08-16T17:42:50Z","shipment_id":"shp_b948e155624f4fc89627e78844e454c7","carrier":"USPS","tracking_details":[{"object":"TrackingDetail","message":"Pre-Shipment Info Sent to USPS","description":null,"status":"pre_transit","status_detail":"status_update","datetime":"2022-07-16T17:42:50Z","source":"USPS","carrier_code":null,"tracking_location":{"object":"TrackingLocation","city":null,"state":null,"country":null,"zip":null}},{"object":"TrackingDetail","message":"Shipping Label Created","description":null,"status":"pre_transit","status_detail":"status_update","datetime":"2022-07-17T06:19:50Z","source":"USPS","carrier_code":null,"tracking_location":{"object":"TrackingLocation","city":"HOUSTON","state":"TX","country":null,"zip":"77063"}}],"fees":[],"carrier_detail":{"object":"CarrierDetail","service":"First-Class Package Service","container_type":null,"est_delivery_date_local":null,"est_delivery_time_local":null,"origin_location":"HOUSTON TX, 77001","origin_tracking_location":{"object":"TrackingLocation","city":"HOUSTON","state":"TX","country":null,"zip":"77063"},"destination_location":"CHARLESTON SC, 29401","destination_tracking_location":null,"guaranteed_delivery_date":null,"alternate_identifier":null,"initial_delivery_attempt":null},"public_url":"https:\/\/track.easypost.com\/djE6dHJrXzExYTQ5OWQ1NjYyMjQwMzA5MDA5ZmI5OWZhMDdkZmFi"},"to_address":{"id":"adr_d8af32e01d8a11edb1a1ac1f6bc72124","object":"Address","created_at":"2022-08-16T17:42:49+00:00","updated_at":"2022-08-16T17:42:49+00:00","name":"JACK SPARROW","company":null,"street1":"388 TOWNSEND ST APT 20","street2":null,"city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"5555555555","email":"TEST@EXAMPLE.COM","mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America\/Los_Angeles"}}}},"usps_zone":4,"return_address":{"id":"adr_d8b1082d1d8a11edb1a4ac1f6bc72124","object":"Address","created_at":"2022-08-16T17:42:49+00:00","updated_at":"2022-08-16T17:42:49+00:00","name":"Elizabeth Swan","company":null,"street1":"179 N Harbor Dr","street2":null,"city":"Redondo Beach","state":"CA","zip":"90277","country":"US","phone":"5555555555","email":"test@example.com","mode":"test","carrier_facility":null,"residential":null,"federal_tax_id":null,"state_tax_id":null,"verifications":[]},"buyer_address":{"id":"adr_d8af32e01d8a11edb1a1ac1f6bc72124","object":"Address","created_at":"2022-08-16T17:42:49+00:00","updated_at":"2022-08-16T17:42:49+00:00","name":"JACK SPARROW","company":null,"street1":"388 TOWNSEND ST APT 20","street2":null,"city":"SAN FRANCISCO","state":"CA","zip":"94107-1670","country":"US","phone":"5555555555","email":"TEST@EXAMPLE.COM","mode":"test","carrier_facility":null,"residential":true,"federal_tax_id":null,"state_tax_id":null,"verifications":{"zip4":{"success":true,"errors":[],"details":null},"delivery":{"success":true,"errors":[],"details":{"latitude":37.77551,"longitude":-122.39697,"time_zone":"America\/Los_Angeles"}}}},"forms":[],"fees":[{"object":"Fee","type":"LabelFee","amount":"0.00000","charged":true,"refunded":false},{"object":"Fee","type":"PostageFee","amount":"5.57000","charged":true,"refunded":false},{"object":"Fee","type":"InsuranceFee","amount":"0.25000","charged":true,"refunded":false}],"id":"shp_b948e155624f4fc89627e78844e454c7","object":"Shipment"}'
        curl_info:
            url: 'https://api.easypost.com/v2/shipments/shp_b948e155624f4fc89627e78844e454c7/refund'
            content_type: 'application/json; charset=utf-8'
            http_code: 200
            header_size: 728
            request_size: 328
            filetime: -1
            ssl_verify_result: 0
            redirect_count: 0
            total_time: 0.410104
            namelookup_time: 0.002259
            connect_time: 0.076163
            pretransfer_time: 0.173344
            size_upload: 0.0
            size_download: 8218.0
            speed_download: 20038.0
            speed_upload: 0.0
            download_content_length: 8218.0
            upload_content_length: 0.0
            starttransfer_time: 0.409951
            redirect_time: 0.0
            redirect_url: ''
            primary_ip: 169.62.110.130
            certinfo: {  }
            primary_port: 443
            local_ip: 10.130.6.17
            local_port: 51884
            http_version: 3
            protocol: 2
            ssl_verifyresult: 0
            scheme: HTTPS
            appconnect_time_us: 173122
            connect_time_us: 76163
            namelookup_time_us: 2259
            pretransfer_time_us: 173344
            redirect_time_us: 0
            starttransfer_time_us: 409951
            total_time_us: 410104
